7767517
7 7
Input                    in0                      0 1 in0
Input                    in1                      0 1 in1
InnerProduct             linear_2                 1 1 in1 2 0=512 1=1 2=262144 8=2
InnerProduct             linear_1                 1 1 in0 3 0=512 1=1 2=262144 8=2
BinaryOp                 add_0                    2 1 3 2 4
TanH                     tanh_0                   1 1 4 5
InnerProduct             linear_3                 1 1 5 out0 0=6020 1=1 2=3082240 8=2
